OpenFoam/validation1rod/bug/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.7;

boundaryField
{   

   Inlet         { type totalTemperature; T0 uniform 293.7; gamma 1.4; }
   Outlet        { type inletOutlet; inletValue uniform 293.7; value uniform 293.7; }
   Outterwall    { type zeroGradient; }
     
   "fluid_to_.*"     
   {
        type            externalWallHeatFluxTemperature;
        kappaMethod     fluidThermo;
        q               uniform 0;
        value           uniform 293.7;
    }

   ".*Wedge"   { type wedge; }
}

