OpenFoam/validation1rod/bug/0/p_rgh
FoamFile { version 2.0; format ascii; class volScalarField; object p_rgh; }

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101324.91;

boundaryField
{
    Inlet          { type prghTotalPressure;     p0 uniform 101325; }
    Outlet         { type outletPrghPressure; value uniform 101325; }
    Outterwall     { type fixedFluxPressure;  value uniform 101325; }
    "fluid_to_.*"  { type fixedFluxPressure;  value uniform 101325; }
   ".*Wedge"       { type wedge; }
}