OpenFoam/validation1rod/bug/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
( 
    (0 0 1500)                                      //0
    (3.196954309061945 -0.1395820395690752     0)   //1  
    (3.196954309061945 -0.1395820395690752  1500)   //2 
    (0 0    0)                                      //3   
    (3.196954309061945  0.1395820395690752     0)   //4
    (3.196954309061945  0.1395820395690752  1500)   //5
    (11.289244903874993 -0.4928990772282968     0)   //6  
    (11.289244903874993  0.4928990772282968     0)   //7
    (11.289244903874993 -0.4928990772282968  1500)   //8 
    (11.289244903874993  0.4928990772282968  1500)   //9

    (0 0 1500)                                      //0
    (3.196954309061945 -0.1395820395690752     0)   //1  
    (3.196954309061945 -0.1395820395690752  1500)   //2 
    (0 0    0)                                      //3   
    (3.196954309061945  0.1395820395690752     0)   //4
    (3.196954309061945  0.1395820395690752  1500)   //5
    (112.89244903874993 -04.928990772282968     0)   //6  
    (112.89244903874993  04.928990772282968     0)   //7
    (112.89244903874993 -04.928990772282968  1500)   //8 
    (112.89244903874993  04.928990772282968  1500)   //9
);
 
blocks
(
    //hex (1 6 7 4 2 8 9 5) (50 1 100) simpleGrading (107 1 1)
    hex (1 6 7 4 2 8 9 5) (100 1 100) simpleGrading ( ( (0.5 0.5 107) (0.5 0.5 0.01) ) 1 1)
);
 
edges
(
    arc 1 4 (3.2 0 -1500)
    arc 2 5 (3.2 0 0)
);
 
boundary
(
    LeftWedge       { type wedge; faces ((1 6 8 2)); }
    RightWedge      { type wedge; faces ((4 5 9 7)); }

    Inlet           { type patch; faces ((1 4 7 6)); }
    Outlet          { type patch; faces ((2 8 9 5)); }

    Outterwall      { type wall;  faces ((6 7 9 8)); }
    fluid_to_cencil { type wall;  faces ((1 2 5 4)); }
);
 
mergePatchPairs();


/*
vertices
(   
    (0 0 1500)                                      //0
    (3.196954309061945 -0.1395820395690752     0)   //1  
    (3.196954309061945 -0.1395820395690752  1500)   //2 
    (0 0    0)                                      //3   
    (3.196954309061945  0.1395820395690752     0)   //4
    (3.196954309061945  0.1395820395690752  1500)   //5
    (11.289244903874993 -0.4928990772282968     0)   //6  
    (11.289244903874993  0.4928990772282968     0)   //7
    (11.289244903874993 -0.4928990772282968  1500)   //8 
    (11.289244903874993  0.4928990772282968  1500)   //9
);
*/